Revit 2027 API
BuiltInFailures.ConnectorFailures.ExistsForSelectedElement Property
 Connections already exists for selected element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExistsForSelectedElement { get; }
Public Shared ReadOnly Property ExistsForSelectedElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExistsForSelectedElement {
	FailureDefinitionId^ get ();
}
static member ExistsForSelectedElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace